{
    "Jack Mackerel": {
        "description": "Tastes similar to sardine.\n\tDense, rich and oily.",
        "culinary_uses": "Can be fried, baked, poached, grilled, marinated, smoked and barbecued.&nbsp;[1]\n\tSold fresh, smoked, canned and frozen.&nbsp;[3]\n\tFor a recipe for barbequed mackerel, visit BBC's Good Food.&nbsp;[10]\n\tA demonstration on how to filet and make mackerel sushi can be found on YouTube. [12]",
        "edible_portions": "The flesh is edible.\n\tThe bones can be eaten if in canned form (boiled).",
        "url": "https://caseagrant.ucsd.edu/seafood-profiles/jack-mackerel"
    },
    "Market Squid": {
        "description": "Raw squid should be moist, shiny, and ivory colored.&nbsp;[1]\n\tOnce cooked, the meat turns white and has a mild, slightly sweet taste.&nbsp;[1]",
        "culinary_uses": "",
        "edible_portions": "The arms (tentacles), mantle (tube), and fins (wings) are all edible.&nbsp;[1]",
        "url": "https://caseagrant.ucsd.edu/seafood-profiles/market-squid"
    },
    "Lingcod": {
        "description": "The raw flesh has&nbsp;a blue-green tint, but turns white when cooked.&nbsp;[1,2, 3,4]\n\tMeat is tender and firm, with large, soft, moist, mild-tasting flakes.&nbsp;[1,4]",
        "culinary_uses": "",
        "edible_portions": "Usually eaten with head and skin removed.&nbsp;[4,8]",
        "url": "https://caseagrant.ucsd.edu/seafood-profiles/lingcod"
    },
    "Sheep Crab": {
        "description": "Has a delicate flavor and firm texture. [3]",
        "culinary_uses": "For a guide on how to clean and cook sheep crab, visit Spearboard&nbsp;or Tom Hunt. [4,5]\n\tFor a South African crab curry recipe, visit EatMee Recipes. [12]\n\tFor a Chilean crab dip recipe, visit Saveur. [13]",
        "edible_portions": "&nbsp;Meat in the claws and body are eaten. [3]",
        "url": "https://caseagrant.ucsd.edu/seafood-profiles/sheep-crab"
    },
    "Sickle Pomfret": {
        "description": "Has a firm texture with moderate flavor.&nbsp;[2]\n\tMeat is characterized by large flakes and a pink-white color.&nbsp;[12]",
        "culinary_uses": "Has a high oil content, which makes it good for grilling, broiling, baking, sauteing, and also in sushi.&nbsp;[2]\n\tFor a monchong with black garlic citrus butter sauce recipe, visit Catalina OP. [14]\n\tFor a monchong in coconut cream spinach sauce recipe, visit Kahaki Kitchen. [15]",
        "edible_portions": "Typically only the fillets are eaten.",
        "url": "https://caseagrant.ucsd.edu/seafood-profiles/sickle-pomfret"
    },
    "California Two Spot Octopus": {
        "description": "The long muscle fibers can make for tough, chewy meat if not properly tenderized or if overcooked.&nbsp;[6]\n\tThe meat has a slightly sweet taste, similar to shellfish and squid.&nbsp;[6]\n\tSkin is colored and gelatinous, and the meat is white.&nbsp;[6]",
        "culinary_uses": "Cooking time is short since species is small as to prevent the meat from becoming tough. [6]\n\tUsually blanched in wine or water to cook meat, then served hot on the grill or marinated cold for use in salads and ceviche. [6]\n\tUsually prepared with minimal seasonings such as lemon and herbs as to&nbsp;not overwhelm the light sweet flavor. [6]\n\tVersatile: recipes that use octopus include pastas, stews, soups, salads, and barbeque. [6]\n\tFor a recipe for Korean spicy stir-fried octopus, visit Maangchi. [8]",
        "edible_portions": "All of the meat and skin is edible, including tentacles; beak, eyes, innards, and ink sac are removed and discarded before consumption. [6]",
        "url": "https://caseagrant.ucsd.edu/seafood-profiles/california-two-spot-octopus"
    },
    "California Skate": {
        "description": "Firm with a mild taste, but can have a stringy texture because of the wing structure.&nbsp;[3,5]\n\tWhen cooked, the slight pink color turns off white.&nbsp;[3,5]&nbsp;&nbsp;",
        "culinary_uses": "Sold as skin-on wings, skin-off wings, and fillets, but the skin is too tough to be edible.&nbsp;[6]\n\tTypically baked, deep fried, poached, or sautéed.&nbsp;[6]\n\tEnjoyed with capers, mushrooms, spinach and potatoes, tomatoes and beans, and in pastas.&nbsp;[9,10]\n\tFor a recipe for baked skate wing with mushroom, shallot, and Gruyère cheese, visit Great British Chefs. [20]",
        "edible_portions": "The meat is located on the top and bottom of the cartilage plate through the middle of the wings.&nbsp;[3]",
        "url": "https://caseagrant.ucsd.edu/seafood-profiles/california-skate"
    },
    "Shovelnose Guitarfish": {
        "description": "Meat is often served fried and buttery, but can also be thick like steak.&nbsp;[6,9]\n\tAlthough it is in the same family as shark, it is often classified as white fish as it&nbsp;&nbsp;",
        "culinary_uses": "Usually called “shark steak” or sold as&nbsp;“fish n’ chips” in Santa Barbara. Dried guitarfish is also sold as curios.&nbsp;[6]\n\tIt can be made for cocktail, kabobs, and more--visit Pier Fishing for recipe suggestions. [8]\n\tFor a shovelnose guitarfish recipe, visit Surf Fishing in So Cal. [14]",
        "edible_portions": "Trunk, tail, and loin areas of the fish are generally used. [6]",
        "url": "https://caseagrant.ucsd.edu/seafood-profiles/shovelnose-guitarfish"
    },
    "California Sea Cucumber": {
        "description": "It has little to no taste, but soaks up the flavors it's cooked in.&nbsp;[7]\n\tThe texture is gelatinous. [7]",
        "culinary_uses": "Often boiled, dried, and salted before being exported, as well as frozen or pickled. [2]\n\tSold fresh in California.&nbsp;[2]\n\tTypically, sea cucumber is&nbsp;used in Chinese soups or stews. [2]\n\tFor a recipe for braised sea cucumbers with mushrooms, visit Pacific Sea Cucumbers Harvesters' Association. [10]",
        "edible_portions": "Sea cucumber an be eaten whole, or just the skin or gonads. [2]",
        "url": "https://caseagrant.ucsd.edu/seafood-profiles/california-sea-cucumber"
    },
    "Spot Prawn": {
        "description": "Has a sweet, succulent flavor.&nbsp;[5]",
        "culinary_uses": "Minimal preparation is recommended to let the naturally sweet and rich flavor to shine through. [5]\n\tIt is popularly eaten raw, known as amaebi&nbsp;in sushi. [5]\n\tFor some recipe suggestions, visit&nbsp;hunger-angler-gardener-cook&nbsp;or Van Isle Marina. [5,10]",
        "edible_portions": "Most of the demand is for the meat, but it’s possible to eat the shell, tail, and head. [7]",
        "url": "https://caseagrant.ucsd.edu/seafood-profiles/spot-prawn"
    },
    "Pacific Sanddab": {
        "description": "Meat is sweeter than most other fish, akin to trout.&nbsp;[3]",
        "culinary_uses": "Can be&nbsp;cut into fillets and deboned after cooking.&nbsp;[3]\n\tFor a recipe for pan fried sanddab with olive oil, butter and light breading, visit 365 Whole Foods. [3]\n\tFor a recipe for san dabs meuniere, visit Emeril Lagasse. [14]\n\tThe skin can be left on (it tastes like fries).&nbsp;[3]",
        "edible_portions": "Edible whole or as fillets.&nbsp;[3]",
        "url": "https://caseagrant.ucsd.edu/seafood-profiles/pacific-sanddab"
    },
    "Pacific Mackerel": {
        "description": "It has firm, oily, dark meat with a strong flavor, rich in omega-3 fatty acids. [1]\n\tMackerel has large bones which are easily removed from the cooked flesh.&nbsp;[4]\n\tThe meat spoils quickly - this fish should be promptly frozen, refrigerated, or cured. [4]",
        "culinary_uses": "It is best prepared without adding additional oils or fats to the meat, i.e. roasted, baked, or grilled, as the naturally oily meat self-bastes during cooking. [4]\n\tMackerel's robust flavor is well-complemented by acidic, spice-heavy, or fruity sauces. [4]\n\tFor a Nigerian Mackerel and Tomato Sauce recipe, visit Nigerian Lazy Chef. [9]\n\tFor a Filipino recipe for Fish kinilaw, visit SCMP Cooking. [10]",
        "edible_portions": "Pacific mackerel is sold fresh, frozen, or cured; whole or filleted.",
        "url": "https://caseagrant.ucsd.edu/seafood-profiles/pacific-mackerel"
    },
    "Wavy Turban Snail": {
        "description": "Has an abalone-like texture and taste; the foot of the snail is processed and sold to restaurants as an abalone-like product, “wavalone”.&nbsp;[1]",
        "culinary_uses": "Most recipes for abalone and sea snails can be adapted to the wavy turban snail! [1]\n\tCan be prepared many ways: grilled, sautéed, battered and fried, in pastas, in chowders and soups, and in stir-fries.&nbsp;[8,9,10]\n\tFor a spicy Korean sea snail salad recipe that wavy turban snail can be substitued in, visit Beyond Kimchee.&nbsp;[13]\n\tFor a Bahamian conch fritter recipe that can use sea snail as a substitute, visit Nassau Paradise Island. [14]",
        "edible_portions": "Current market demand is for the foot.&nbsp;[1]\n\tThe operculum should be removed.&nbsp;[8]\n\tThe snail’s intestines are bitter in taste and are sometimes eaten, sometimes removed.&nbsp;[8,9]",
        "url": "https://caseagrant.ucsd.edu/seafood-profiles/wavy-turban-snail"
    },
    "Pacific Oyster": {
        "description": "Highly valued for its sweet and mild flavor.\n\tHas a salty kick, and a delicious buttery texture.",
        "culinary_uses": "Local oysters are available fresh; imported can be found canned, or frozen.&nbsp;[8]\n\tShucking, or opening, the oyster requires a special shucking knife inserted into the shell to pry it open, and to cut the hinge and adductor muscle in order to remove meat.&nbsp;[9]\n\tMany people prefer raw oyster, but it can also be roasted, steamed, fried, scalloped, stewed, baked, stuffed, boiled, marinated, poached and sautéed.\n\tSome meal ideas include&nbsp;oyster stew, pan fried oysters, scalloped oysters with fennel, glazed oysters on crab and leeks, and chicken with oysters and straw mushrooms.&nbsp;[10]&nbsp;",
        "edible_portions": "Entire contents of the shell.",
        "url": "https://caseagrant.ucsd.edu/seafood-profiles/pacific-oyster"
    },
    "Pacific Spiny Dogfish": {
        "description": "Raw and cooked meat is white, and the outer flesh can have a red color that turns brown when cooked. It is flaky and firm. [1,6]\n\tHas a sweet, mild flavor and has more oil than other sharks. [1,6]\n\tWhen purchasing spiny dogfish, a slight metallic odor is acceptable but an ammonia taint is not. [6]",
        "culinary_uses": "",
        "edible_portions": "",
        "url": "https://caseagrant.ucsd.edu/seafood-profiles/pacific-spiny-dogfish"
    },
    "Pacific Bonito": {
        "description": "",
        "culinary_uses": "Available whole, as filets, or steaks.&nbsp;\n\tShould be bled and put on ice immediately after catching, and bloodlines should be removed. [14]\n\tGenerally brined prior to cooking.&nbsp;[5]\n\tFor a Japanese simmered bonito recipe, visit Recipe Tin Japan. [16]\n\tFor recipe for grilled bonito, visit Greedy Gourmet. [17]",
        "edible_portions": "Can be eaten whole.&nbsp;[4]&nbsp;",
        "url": "https://caseagrant.ucsd.edu/seafood-profiles/pacific-bonito"
    }
}